// unionVillageMap.js
const unionVillageMap = {
  "সুন্দরপুর-দূর্গাপুর": [
    "কাদিরকোল","সিংদহ","আলাইপুর","কমলাপুর","সুন্দরপুর","ডুমুরতলা","ইছাপুর","দুর্গাপুর",
    "মহাদেবপুর","বেজপাড়া","ছোট ভাটপাড়া","বড় ভাটপাড়া","পাইকপাড়া","কাশিমা","গুঞ্জনগর","কাদিপুর"
  ],
  "জামাল": [
    "তৈলকুপী","কামারাইল","গুটিয়ানী","দুধরাজপুর","গোপালপুর","হরদেবপুর","উল্যা","জয়নগর",
    "ভাটের ভাটপাড়া","বাগডাঙ্গা","খানজাপুর","কাবিলপুর","বড় ডাউটি","পারখালকুলা","নাকোবাড়িয়া",
    "বাসুদেবপুর","হুদা ডাউটি","বড় তালিয়ান","খোর্দ্দ তালিয়ান","নাটোপাড়া"
  ],
  "কোলা": [
    "কোলা","কামালহাট","রামচন্দ্রপুর","বিনোদপুর","সড়াবাড়ীয়া","দৌলতপুর","বড়বায়সা",
    "কাদিরডাঙ্গা","তেঘরীহুদা","কাকলাশ","দাসাবায়সা"
  ],
  "নিয়ামতপুর": [
    "নিয়ামতপুর","বারই পাড়া","সুইতলা","মল্লিকপুর","সুইতলা–মল্লিকপুর","ওয়াহেদপুর",
    "আব্দুল্লাহপুর","বুড়িরপাড়া","হাদিপুর","শিবনগর","সুবিল স্বর্ণকার পাড়া",
    "করিম সরকার বাড়ী","মালেক","স্থানীয় পাড়া"
  ],
  "শিমলা-রোকনপুর": [
    "বড় শিমলা","রোকনপুর","মনোহরপুর","পোখুরিয়া","জাবড়া","রাঙ্গানিয়া","রাঙ্গামাটি"
  ],
  "ত্রিলোচনপুর": [
    "ত্রিলোচনপুর","বালিয়াডাঙ্গা","দাদপুর","বাউশগাছি","মহেশপুর","সুন্দরপুর","দুর্গাপুর","জামাল",
    "কোটচাঁদপুর","নিয়ামতপুর","শিমলা-রোকনপুর","কোলা","রায়গ্রাম","রাখালগাছি",
    "বারবাজার","কাষ্টভাঙ্গা","মালিয়াট"
  ],
  "রায়গ্রাম": [
    "বড় রায়গ্রাম","বুজরুকমুন্দিয়া","খামারমুন্দিয়া","দুলালমুন্দিয়া","খোর্দ্দরায়গ্রাম",
    "গোমরাইল","ভাটাডাঙ্গা","সিংগী","ফরিয়াদকাটি","দেবরাজপুর","একতারপুর","রায়গ্রাম","ইছাখালী"
  ],
  "মালিয়াট": [
    "মালিয়াট","বেথুলী","রাড়ীপাড়া","মাগুরা","ভিটাখোলা","গয়েশপুর","শশারপাড়া",
    "দিঘারপাড়া","তত্তিপুর","ষাটবাড়িয়া","চাকুলিয়া","মনোহরপুর",
    "পরমানন্দী","পাঁচকাহুনিয়া","পারখির্দ্দাহ"
  ],
  "বারবাজার": [
    "বেলাট দৌলতপুর","বারবাজার","সাদিকপুর","হাসিলবাগ","মিঠাপুকুর","ফুলবাড়ী","পিরোজপুর",
    "ঠিকডাঙ্গা","বাদুরগাছা","বাদেডিহি","মহিষাহাটী","মঙ্গলপৈতা","সোনালীডাঙ্গা",
    "বারফা","মাজদিয়া","জলকার মাজদিয়া","সুবর্ণসারা","জগন্নাথপুর","লুচিয়া"
  ],
  "কাষ্টভাঙ্গা": [
    "নলভাঙ্গা","পারকালীগঞ্জ","কোটচাঁদপুর","বারবাজার","রাখালগাছি","সুন্দরপুর","দুর্গাপুর",
    "জামাল","কোলা","নিয়ামতপুর","শিমলা-রোকনপুর","ত্রিলোচনপুর","রায়গ্রাম","মালিয়াট"
  ]
};